//Оператори розгалуження



// 0
// ''
// undefined
// null
// NaN 
//false
//завжди буде true окрім цих значень

//console.log(Boolean());

//* Логічне I (оператор &&)
// Запинається на брехні
//Повертає те на чому запнулось або останній операнд

// console.log(10 && 15 && 'Hello');

// console.log('' || '0' || 15);


/*
 * Напиши скрипт який перевірить входження 
 * числа у відрізок зазначений x1 та x2. *
 * - До x1
 * - Після x2
 * - Від x1 до x2
 * - До x1 або після x2
 */
//                  10                      30 
// ================================================================
//                  x1                      x2
// const x1 = 10;
// const x2 = 30;
// const number = 40;

// console.log(`Число ${number} потрапляє у відрізок до ${x1}? `, number < x1);

// console.log(`Число ${number} потрапляє у відрізок після ${x2}?`, number > x2 );

// console.log(`Число ${number} потрапляє у відрізок від ${x1} до ${x2}?`, number > x1 && number < x2);

// console.log(`Число ${number} потрапляє у відрізок до ${x1} або після ${x2}?`, );



//x1 > number || number > x2
//10 > 40 || 20 > 30
//false || true
//true



/*
 * Напиши скрипт перевірки підписки користувача під час доступу до контенту
 * - Є три типи підписки: free, pro и vip.
 * - Отримати доступ можуть тільки pro и vip
 */

const sub = 'pro';

// якщо користувач pro або користувач vip тоді є доступ

const canAccessContent = sub === 'pro' || sub === 'vip';


console.log('Є доступ до контенту? ', canAccessContent);