//Оператори розгалуження



// 0
// ''
// undefined
// null
// NaN 
//false
//завжди буде true окрім цих значень

//console.log(Boolean());

//* Логічне I (оператор &&)
// Запинається на брехні
//Повертає те на чому запнулось або останній операнд

// console.log(10 && 15 && 'Hello');

// console.log('' || '0' || 15);


/*
 * Напиши скрипт який перевірить входження 
 * числа у відрізок зазначений x1 та x2. *
 * - До x1
 * - Після x2
 * - Від x1 до x2
 * - До x1 або після x2
 */
//                  10                      30 
// ================================================================
//                  x1                      x2
// const x1 = 10;
// const x2 = 30;
// const number = 40;

// console.log(`Число ${number} потрапляє у відрізок до ${x1}? `, number < x1);

// console.log(`Число ${number} потрапляє у відрізок після ${x2}?`, number > x2 );

// console.log(`Число ${number} потрапляє у відрізок від ${x1} до ${x2}?`, number > x1 && number < x2);

// console.log(`Число ${number} потрапляє у відрізок до ${x1} або після ${x2}?`, );



//x1 > number || number > x2
//10 > 40 || 20 > 30
//false || true
//true



/*
 * Напиши скрипт перевірки підписки користувача під час доступу до контенту
 * - Є три типи підписки: free, pro и vip.
 * - Отримати доступ можуть тільки pro и vip
 */

// const sub = 'pro';

// якщо користувач pro або користувач vip тоді є доступ

// const canAccessContent = sub === 'pro' || sub === 'vip';


// console.log('Є доступ до контенту? ', canAccessContent);



/*
 * Напиши скрипт підрахунку суми покупки зі знижкою в залежності від витраченої 
 * суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в змінній totalSpent
 * - Сума поточного платежа зберігається в змінній payment
 * - Знижка зберігається в змінній discount
* - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»
 */
    
    
    
//     const totalSpent = 2000;
//     let payment = 500;
//     let discount = 0;


// if (100 < totalSpent && totalSpent < 1000){
//     discount = 2;
//     payment -= payment * discount / 100;
//     alert(`бронзовий партнер, знижка 2%. До сплати = ${discount}` );
// } else if(1000 <= totalSpent && totalSpent < 5000){
//     discount = payment * 5 / 100;
//     payment -= discount;
//     alert(`бронзовий партнер, знижка 5%. До сплати = ${discount}` );
// } else if(totalSpent > 5000){
//     discount = payment * 10 / 100;
//     payment -= discount;
//     alert(`бронзовий партнер, знижка 10%. До сплати = ${discount}` );
// }else if(totalSpent < 100){
//     alert(`не партнер, знижка 0%. До сплати = ${discount}` );
// }

// alert(`оформляємо замовлення на суму ${payment} зі знижкою ${discount}`);


    // 'Бронзовий партнер, знижка 2%'
    // 'Срібний партнер, знижка 5%'
    // 'Золотий партнер, знижка 10%'
    // 'У вас ще немає партнерської знижки'





    //Використовуючи конструкцію if..else, напишіть код, що запитує:
    // ‘Яка “офіційна” назва JavaScript?’ 
    //Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”,
    // в іншому випадку — виведіть: “Ви не знаєте? ECMAScript!”

// const answer = prompt(`Яка “офіційна” назва JavaScript?`);
// if(answer === 'ECMAScript'){
//     console.log('Правильно!')
// } else {console.log('Ви не знаєте? ECMAScript!')}

